Revit 2026 API

# DockablePaneId Properties

---

The DockablePaneId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. (Inherited from GuidEnum) |

#### Reference

DockablePaneId Class

Autodesk.Revit.UI Namespace